<template>
  <div class="bg-[#FBF8FB] relative">
    <f-modal ref="modalForm">
      <div class="grid grid-cols-1 gap-3 w-full max-w-[300px]">
        <div class="flex flex-col gap-1">
          <label for="">Имя* </label>
          <input
            v-model="form.name"
            type="text"
            class="border p-2 rounded-md"
          />
        </div>
        <div class="flex flex-col gap-1">
          <label for="">Телефон* </label>
          <input
            v-model="form.phone"
            type="text"
            class="border p-2 rounded-md"
            placeholder="+7"
            v-facade="'+7 (###) ###-##-##'"
          />
        </div>
        <div class="flex flex-col gap-1 w-full">
          <label for="">Возраст ребенка </label>
          <div class="border p-2 rounded-md flex justify-between items-center">
            <button
              @click="minus"
              class="py-2 px-4 bg-slate-200 flex justify-center items-center rounded-md"
            >
              -
            </button>
            <span class="text-sm">{{ form.vozrast }}</span>
            <button
              @click="plus"
              class="py-2 px-4 bg-slate-200 flex justify-center items-center rounded-md"
            >
              +
            </button>
          </div>
        </div>
        <button
          v-if="form.phone.length == 18 && form.name.length >= 2"
          class="border-2 border-purple-500 text-sm sm:text-lg font-semibold px-5 py-2 rounded-md flex justify-center items-center gap-2"
        >
          <svg
            xmlns="http://www.w3.org/2000/svg"
            fill="none"
            viewBox="0 0 24 24"
            stroke-width="1.5"
            stroke="currentColor"
            class="w-4 h-4 rotate-45 text-purple-500"
          >
            <path
              stroke-linecap="round"
              stroke-linejoin="round"
              d="M13.5 4.5L21 12m0 0l-7.5 7.5M21 12H3"
            />
          </svg>

          <span
            @click="getTeelegrammToMain()"
            class=" pb-[1px] text-purple-500 font-bold"
            >ОТПРАВИТЬ</span
          >
        </button>
        <button
          v-else
          class="opacity-50 border-2 border-purple-500 text-sm sm:text-lg font-semibold px-5 py-2 rounded-md flex justify-center items-center gap-2"
        >
          <span class=" pb-[1px] text-purple-500 font-bold">ОТПРАВИТЬ</span>
        </button>
        <span v-if="succes == true" class="text-center text-sm "
          >Спасибо! Наш менеджер перезвонит Вам в течение 15 минут.</span
        >
        <span class="text-slate-400 text-xs text-center"
          >Нажимая "Отправить", вы соглашаетесь с Политикой обработки
          персональных данных</span
        >
      </div>
    </f-modal>
    <the-header @openModal="openModal" />
    <div class="container bg-[#FBF8FB] flex justify-center gap-12  pt-32">
      <span class="">
        <p class="font-bold text-center py-4">Политика в отношении обработки персональных данных</p>
        <p>1. Общие положения</p>
        <p>
          Настоящая политика обработки персональных данных составлена в
          соответствии
        </p>
        <p>
          с требованиями Федерального закона от 27.07.2006. No152-ФЗ &laquo;О
          персональных
        </p>
        <p>
          данных&raquo; (далее&nbsp;-&nbsp;Закон о персональных данных) и
          определяет порядок обработки
        </p>
        <p>
          персональных данных и меры по&nbsp;обеспечению безопасности
          персональных
        </p>
        <p>
          данных, предпринимаемые&nbsp;ИП Петросян
          К.В.&nbsp;(далее&nbsp;&ndash;&nbsp;Оператор).
        </p>
        <p>
          1.1. Оператор ставит своей важнейшей целью и условием осуществления
          своей
        </p>
        <p>
          деятельности соблюдение прав и свобод человека и гражданина при
          обработке
        </p>
        <p>
          его персональных данных, в том числе защиты прав на неприкосновенность
        </p>
        <p>частной жизни, личную и семейную тайну.</p>
        <p>
          1.2. Настоящая политика Оператора в отношении обработки персональных
        </p>
        <p>
          данных (далее&nbsp;&ndash;&nbsp;Политика) применяется ко всей
          информации, которую Оператор
        </p>
        <p>
          может получить о посетителях веб-сайта&nbsp;https://kiber-stav.ru/.
        </p>
        <p>2. Основные понятия, используемые в Политике</p>
        <p>
          2.1. Автоматизированная обработка персональных
          данных&nbsp;&ndash;&nbsp;обработка
        </p>
        <p>персональных данных с помощью средств вычислительной техники.</p>
        <p>
          2.2. Блокирование персональных&nbsp;данных&nbsp;&ndash;&nbsp;временное
          прекращение обработки
        </p>
        <p>
          персональных данных (за исключением случаев, если обработка необходима
          для
        </p>
        <p>уточнения персональных данных).</p>
        <p>
          2.3. Веб-сайт&nbsp;&ndash;&nbsp;совокупность графических и
          информационных материалов, а
        </p>
        <p>
          также программ для ЭВМ и баз данных, обеспечивающих их доступность в
          сети
        </p>
        <p>интернет по сетевому адресу&nbsp;https://kiber-stav.ru/.</p>
        <p>
          2.4. Информационная система персональных
          данных&nbsp;&mdash;&nbsp;совокупность
        </p>
        <p>
          содержащихся в базах данных персональных данных, и обеспечивающих их
        </p>
        <p>обработку информационных технологий и технических средств.</p>
        <p>
          2.5. Обезличивание персональных данных&nbsp;&mdash;&nbsp;действия, в
          результате которых
        </p>
        <p>невозможно определить без использования дополнительной информации</p>
        <p>
          принадлежность персональных данных конкретному Пользователю или иному
        </p>
        <p>субъекту персональных&nbsp;данных.</p>
        <p>
          2.6. Обработка персональных данных&nbsp;&ndash;&nbsp;любое действие
          (операция) или
        </p>
        <p>
          совокупность действий (операций), совершаемых с использованием средств
        </p>
        <p>
          автоматизации или без использования таких средств с персональными
          данными,
        </p>
        <p>
          включая сбор, запись, систематизацию, накопление, хранение, уточнение
        </p>
        <p>(обновление, изменение), извлечение, использование, передачу</p>
        <p>
          (распространение, предоставление, доступ), обезличивание,
          блокирование,
        </p>
        <p>удаление, уничтожение персональных данных.</p>
        <p>
          2.7. Оператор&nbsp;&ndash;&nbsp;государственный орган, муниципальный
          орган, юридическое или
        </p>
        <p>физическое лицо, самостоятельно или совместно с другими лицами</p>
        <p>
          организующие и (или) осуществляющие обработку персональных данных, а
          также
        </p>
        <p>
          определяющие цели обработки персональных данных, состав персональных
        </p>
        <p>
          данных, подлежащих&nbsp;обработке, действия (операции), совершаемые с
        </p>
        <p>персональными данными.</p>
        <p>
          2.8. Персональные данные&nbsp;&ndash;&nbsp;любая информация,
          относящаяся прямо или
        </p>
        <p>косвенно к определенному или определяемому Пользователю веб-</p>
        <p>сайта&nbsp;https://kiber-stav.ru/.</p>
        <div>
          <div tabindex="0"><br /></div>
        </div>
        <div>
          <div><br /></div>
        </div>
        <p>
          2.9. Персональные данные, разрешенные субъектом персональных данных
          для
        </p>
        <p>
          распространения,&nbsp;-&nbsp;персональные данные, доступ
          неограниченного круга лиц к
        </p>
        <p>
          которым предоставлен субъектом персональных данных путем дачи согласия
          на
        </p>
        <p>
          обработку персональных данных, разрешенных субъектом персональных
          данных
        </p>
        <p>
          для распространения в порядке, предусмотренном Законом о персональных
        </p>
        <p>
          данных (далее&nbsp;-&nbsp;персональные данные, разрешенные для
          распространения).
        </p>
        <p>
          2.10. Пользователь&nbsp;&ndash;&nbsp;любой посетитель
          веб-сайта&nbsp;https://kiber-stav.ru/.
        </p>
        <p>
          2.11. Предоставление
          персональных&nbsp;данных&nbsp;&ndash;&nbsp;действия, направленные на
        </p>
        <p>
          раскрытие персональных данных определенному лицу или определенному
          кругу
        </p>
        <p>лиц.</p>
        <p>
          2.12. Распространение персональных данных&nbsp;&ndash;&nbsp;любые
          действия, направленные
        </p>
        <p>
          на раскрытие персональных данных неопределенному кругу лиц (передача
        </p>
        <p>персональных данных) или на ознакомление с персональными данными</p>
        <p>
          неограниченного круга лиц, в том числе обнародование персональных
          данных в
        </p>
        <p>средствах массовой информации, размещение в информационно-</p>
        <p>
          телекоммуникационных сетях или предоставление доступа к персональным
        </p>
        <p>данным каким-либо иным способом.</p>
        <p>
          2.13. Трансграничная передача персональных
          данных&nbsp;&ndash;&nbsp;передача персональных
        </p>
        <p>
          данных на территорию иностранного государства органу власти
          иностранного
        </p>
        <p>
          государства, иностранному физическому или иностранному юридическому
          лицу.
        </p>
        <p>
          2.14. Уничтожение персональных данных&nbsp;&ndash;&nbsp;любые
          действия, в результате которых
        </p>
        <p>персональные данные уничтожаются безвозвратно с невозможностью</p>
        <p>дальнейшего восстановления содержания персональных данных в</p>
        <p>информационной системе персональных данных и (или) уничтожаются</p>
        <p>материальные носители персональных данных.</p>
        <p>3. Основные права и обязанности Оператора</p>
        <p>3.1. Оператор имеет право:</p>
        <p>
          &ndash;&nbsp;получать от субъекта персональных данных достоверные
          информацию и/или
        </p>
        <p>документы, содержащие персональные данные;</p>
        <p>
          &ndash;&nbsp;в случае отзыва субъектом персональных данных согласия на
          обработку
        </p>
        <p>
          персональных данных Оператор вправе продолжить обработку персональных
        </p>
        <p>
          данных без согласия субъекта персональных данных при наличии
          оснований,
        </p>
        <p>указанных в Законе о персональных данных;</p>
        <p>
          &ndash;&nbsp;самостоятельно определять состав и перечень мер,
          необходимых и
        </p>
        <p>
          достаточных для обеспечения выполнения обязанностей, предусмотренных
        </p>
        <p>Законом о персональных данных и принятыми в соответствии с ним</p>
        <p>
          нормативными правовыми актами, если иное не предусмотрено Законом о
        </p>
        <p>персональных данных или другими федеральными законами.</p>
        <p>3.2. Оператор обязан:</p>
        <p>
          &ndash;&nbsp;предоставлять субъекту персональных данных по его просьбе
          информацию,
        </p>
        <p>касающуюся обработки его персональных данных;</p>
        <p>
          &ndash;&nbsp;организовывать обработку персональных данных в порядке,
          установленном
        </p>
        <p>действующим законодательством РФ;</p>
        <p>
          &ndash;&nbsp;отвечать на обращения и запросы субъектов персональных
          данных и их
        </p>
        <p>
          законных представителей в соответствии с требованиями Закона о
          персональных
        </p>
        <p>данных;</p>
        <p>
          &ndash;&nbsp;сообщать в уполномоченный орган по защите
          прав&nbsp;субъектов персональных
        </p>
        <p>
          данных по запросу этого органа необходимую информацию в течение 30
          дней с
        </p>
        <p>даты получения такого запроса;</p>
        <div>
          <div tabindex="0"><br /></div>
        </div>
        <div>
          <div><br /></div>
        </div>
        <p>
          &ndash;&nbsp;публиковать или иным образом обеспечивать неограниченный
          доступ к
        </p>
        <p>настоящей Политике в отношении обработки персональных данных;</p>
        <p>
          &ndash;&nbsp;принимать правовые, организационные и технические меры
          для защиты
        </p>
        <p>
          персональных данных от неправомерного или случайного доступа к ним,
        </p>
        <p>
          уничтожения, изменения, блокирования, копирования, предоставления,
        </p>
        <p>
          распространения персональных данных, а также от иных неправомерных
        </p>
        <p>действий в отношении персональных данных;</p>
        <p>
          &ndash;&nbsp;прекратить передачу (распространение, предоставление,
          доступ) персональных
        </p>
        <p>
          данных, прекратить обработку и уничтожить персональные данные в
          порядке и
        </p>
        <p>случаях, предусмотренных Законом о персональных&nbsp;данных;</p>
        <p>
          &ndash;&nbsp;исполнять иные обязанности, предусмотренные Законом о
          персональных
        </p>
        <p>данных.</p>
        <p>4. Основные права и обязанности субъектов персональных</p>
        <p>данных</p>
        <p>4.1. Субъекты персональных данных имеют право:</p>
        <p>
          &ndash;&nbsp;получать информацию, касающуюся обработки его
          персональных&nbsp;данных, за
        </p>
        <p>
          исключением случаев, предусмотренных федеральными законами. Сведения
        </p>
        <p>
          предоставляются субъекту персональных данных Оператором в доступной
        </p>
        <p>
          форме, и в них не должны содержаться персональные данные, относящиеся
          к
        </p>
        <p>
          другим субъектам персональных данных, за исключением случаев, когда
          имеются
        </p>
        <p>
          законные основания для раскрытия таких персональных данных. Перечень
        </p>
        <p>
          информации и порядок ее получения установлен Законом о персональных
        </p>
        <p>данных;</p>
        <p>
          &ndash;&nbsp;требовать от оператора уточнения его персональных данных,
          их блокирования
        </p>
        <p>
          или уничтожения в случае, если персональные данные являются неполными,
        </p>
        <p>устаревшими, неточными, незаконно полученными или не являются</p>
        <p>необходимыми для заявленной цели обработки, а также принимать</p>
        <p>предусмотренные законом меры по защите своих прав;</p>
        <p>
          &ndash;&nbsp;выдвигать условие предварительного согласия при обработке
          персональных
        </p>
        <p>данных в целях продвижения на рынке товаров, работ и услуг;</p>
        <p>&ndash;&nbsp;на отзыв согласия на обработку персональных данных;</p>
        <p>
          &ndash;&nbsp;обжаловать в уполномоченный орган по защите прав
          субъектов персональных
        </p>
        <p>
          данных или в судебном порядке неправомерные действия или бездействие
        </p>
        <p>Оператора при обработке его персональных данных;</p>
        <p>
          &ndash;&nbsp;на осуществление иных прав, предусмотренных
          законодательством РФ.
        </p>
        <p>4.2. Субъекты персональных данных обязаны:</p>
        <p>&ndash;&nbsp;предоставлять Оператору достоверные данные о себе;</p>
        <p>
          &ndash;&nbsp;сообщать Оператору об уточнении (обновлении, изменении)
          своих
        </p>
        <p>персональных данных.</p>
        <p>
          4.3. Лица, передавшие Оператору недостоверные сведения о себе, либо
          сведения
        </p>
        <p>
          о другом субъекте персональных данных без согласия последнего, несут
        </p>
        <p>ответственность в соответствии с законодательством РФ.</p>
        <p>5. Оператор может обрабатывать следующие персональные</p>
        <p>данные Пользователя</p>
        <p>5.1.&nbsp;Фамилия, имя, отчество.</p>
        <p>5.2.&nbsp;Номера телефонов.</p>
        <p>5.3.&nbsp;Возраст.</p>
        <div>
          <div tabindex="0"><br /></div>
        </div>
        <div>
          <div><br /></div>
        </div>
        <p>
          5.4. Также на сайте происходит сбор и обработка обезличенных данных о
        </p>
        <p>
          посетителях (в т.ч. файлов &laquo;cookie&raquo;) с помощью сервисов
          интернет-статистики
        </p>
        <p>(Яндекс Метрика и Гугл Аналитика и других).</p>
        <p>
          5.5. Вышеперечисленные данные далее по тексту Политики
          объединены&nbsp;общим
        </p>
        <p>понятием Персональные данные.</p>
        <p>
          5.6. Обработка специальных категорий персональных данных, касающихся
        </p>
        <p>
          расовой, национальной принадлежности, политических взглядов,
          религиозных или
        </p>
        <p>
          философских убеждений, интимной жизни, Оператором не осуществляется.
        </p>
        <p>
          5.7.&nbsp;Обработка персональных данных, разрешенных для
          распространения, из
        </p>
        <p>
          числа специальных категорий персональных данных, указанных в ч. 1 ст.
          10
        </p>
        <p>
          Закона о персональных данных, допускается, если соблюдаются запреты и
        </p>
        <p>условия, предусмотренные ст. 10.1 Закона о персональных данных.</p>
        <p>
          5.8. Согласие Пользователя на обработку персональных данных,
          разрешенных
        </p>
        <p>
          для распространения, оформляется отдельно от других согласий на
          обработку его
        </p>
        <p>
          персональных данных. При этом соблюдаются условия, предусмотренные, в
        </p>
        <p>
          частности, ст. 10.1 Закона о персональных данных. Требования к
          содержанию
        </p>
        <p>
          такого согласия устанавливаются уполномоченным органом по защите прав
        </p>
        <p>субъектов персональных данных.</p>
        <p>5.8.1 Согласие на обработку персональных данных, разрешенных для</p>
        <p>
          распространения, Пользователь предоставляет Оператору непосредственно.
        </p>
        <p>
          5.8.2 Оператор обязан в срок не позднее трех рабочих дней с момента
          получения
        </p>
        <p>
          указанного согласия Пользователя опубликовать информацию об условиях
        </p>
        <p>
          обработки, о наличии запретов и условий на обработку неограниченным
          кругом
        </p>
        <p>лиц персональных данных, разрешенных для распространения.</p>
        <p>
          5.8.3 Передача (распространение, предоставление, доступ) персональных
        </p>
        <p>
          данных, разрешенных субъектом персональных данных для распространения,
        </p>
        <p>
          должна быть прекращена в любое время по требованию субъекта
          персональных
        </p>
        <p>
          данных. Данное требование должно включать в себя фамилию, имя,
          отчество (при
        </p>
        <p>
          наличии), контактную информацию (номер телефона, адрес электронной
          почты
        </p>
        <p>
          или почтовый адрес) субъекта персональных данных, а также перечень
        </p>
        <p>
          персональных данных, обработка которых подлежит прекращению. Указанные
          в
        </p>
        <p>данном требовании персональные данные могут обрабатываться только</p>
        <p>Оператором, которому оно направлено.</p>
        <p>5.8.4 Согласие на обработку персональных данных, разрешенных для</p>
        <p>
          распространения, прекращает свое действие с момента поступления
          Оператору
        </p>
        <p>
          требования, указанного в п. 5.8.3 настоящей Политики в отношении
          обработки
        </p>
        <p>персональных данных.</p>
        <p>6. Принципы обработки персональных данных</p>
        <p>6.1. Обработка персональных данных осуществляется на законной и</p>
        <p>справедливой основе.</p>
        <p>
          6.2. Обработка персональных данных ограничивается достижением
          конкретных,
        </p>
        <p>заранее определенных и законных целей. Не допускается обработка</p>
        <p>
          персональных данных, несовместимая с целями сбора персональных данных.
        </p>
        <p>
          6.3. Не допускается объединение баз данных, содержащих персональные
          данные,
        </p>
        <p>
          обработка которых осуществляется в целях, несовместимых между собой.
        </p>
        <p>
          6.4. Обработке подлежат только персональные данные, которые отвечают
          целям
        </p>
        <p>их обработки.</p>
        <p>
          6.5. Содержание и объем обрабатываемых персональных данных
          соответствуют
        </p>
        <p>
          заявленным целям обработки. Не допускается избыточность обрабатываемых
        </p>
        <p>персональных данных по отношению к заявленным целям их обработки.</p>
        <div>
          <div tabindex="0"><br /></div>
        </div>
        <div>
          <div><br /></div>
        </div>
        <p>
          6.6. При обработке персональных данных обеспечивается точность
          персональных
        </p>
        <p>
          данных, их достаточность, а в необходимых случаях и актуальность по
          отношению
        </p>
        <p>
          к целям обработки персональных данных. Оператор принимает необходимые
        </p>
        <p>
          меры и/или обеспечивает их принятие по удалению или уточнению неполных
          или
        </p>
        <p>неточных данных.</p>
        <p>
          6.7. Хранение персональных данных осуществляется&nbsp;в форме,
          позволяющей
        </p>
        <p>
          определить субъекта персональных данных, не дольше, чем этого требуют
          цели
        </p>
        <p>
          обработки персональных данных, если срок хранения персональных данных
          не
        </p>
        <p>установлен федеральным законом, договором, стороной которого,</p>
        <p>
          выгодоприобретателем или&nbsp;поручителем по которому является субъект
        </p>
        <p>
          персональных данных. Обрабатываемые персональные данные уничтожаются
        </p>
        <p>
          либо обезличиваются по достижении целей обработки или в случае утраты
        </p>
        <p>необходимости в достижении этих целей, если иное не предусмотрено</p>
        <p>федеральным законом.</p>
        <p>7. Цели обработки персональных данных</p>
        <p>7.1. Цель обработки персональных данных Пользователя:</p>
        <p>&ndash;&nbsp;Уточнение деталей заявки.</p>
        <p>
          7.2. Также Оператор имеет право направлять Пользователю уведомления о
          новых
        </p>
        <p>
          продуктах и услугах, специальных предложениях и&nbsp;различных
          событиях.
        </p>
        <p>Пользователь всегда может отказаться от получения информационных</p>
        <p>сообщений, направив Оператору письмо на адрес электронной</p>
        <p>
          почты&nbsp;stavropol@kiber-one.com&nbsp;с пометкой &laquo;Отказ от
          уведомлений о новых
        </p>
        <p>продуктах и услугах и специальных предложениях&raquo;.</p>
        <p>
          7.3. Обезличенные данные Пользователей, собираемые с помощью сервисов
        </p>
        <p>
          интернет-статистики, служат для сбора информации о действиях
          Пользователей
        </p>
        <p>на сайте, улучшения качества сайта и его содержания.</p>
        <p>8. Правовые основания обработки персональных данных</p>
        <p>
          8.1. Правовыми основаниями обработки персональных данных Оператором
        </p>
        <p>являются:</p>
        <p>
          &ndash;&nbsp;Федеральный закон &quot;Об информации, информационных
          технологиях и о защите
        </p>
        <p>информации&quot; от 27.07.2006 N 149-ФЗ;</p>
        <p>
          &ndash;&nbsp;федеральные законы, иные нормативно-правовые акты в сфере
          защиты
        </p>
        <p>персональных данных;</p>
        <p>
          &ndash;&nbsp;согласия Пользователей на обработку их персональных
          данных, на обработку
        </p>
        <p>персональных данных, разрешенных для распространения.</p>
        <p>
          8.2. Оператор обрабатывает персональные данные Пользователя только в
          случае
        </p>
        <p>
          их заполнения и/или отправки Пользователем самостоятельно через
          специальные
        </p>
        <p>
          формы, расположенные на сайте&nbsp;https://kiber-stav.ru/&nbsp;или
          направленные
        </p>
        <p>
          Оператору посредством электронной&nbsp;почты. Заполняя соответствующие
          формы
        </p>
        <p>
          и/или отправляя свои персональные данные Оператору, Пользователь
          выражает
        </p>
        <p>свое согласие с данной Политикой.</p>
        <p>
          8.3. Оператор обрабатывает обезличенные данные о Пользователе в
          случае,
        </p>
        <p>
          если это разрешено в настройках браузера Пользователя (включено
          сохранение
        </p>
        <p>
          файлов &laquo;cookie&raquo; и использование технологии JavaScript).
        </p>
        <p>
          8.4. Субъект персональных данных самостоятельно принимает решение о
        </p>
        <p>
          предоставлении его персональных данных и дает согласие свободно, своей
          волей
        </p>
        <p>и в своем интересе.</p>
        <div>
          <div tabindex="0"><br /></div>
        </div>
        <div>
          <div><br /></div>
        </div>
        <p>9. Условия обработки персональных данных</p>
        <p>
          9.1. Обработка персональных данных осуществляется с согласия субъекта
        </p>
        <p>персональных данных на обработку его персональных данных.</p>
        <p>
          9.2. Обработка персональных данных необходима для достижения целей,
        </p>
        <p>предусмотренных международным договором Российской Федерации или</p>
        <p>
          законом, для осуществления возложенных законодательством Российской
        </p>
        <p>Федерации на оператора функций, полномочий и обязанностей.</p>
        <p>9.3. Обработка персональных данных необходима для осуществления</p>
        <p>
          правосудия, исполнения судебного акта, акта другого органа или
          должностного
        </p>
        <p>
          лица, подлежащих исполнению в соответствии с законодательством
          Российской
        </p>
        <p>Федерации об исполнительном производстве.</p>
        <p>
          9.4. Обработка персональных данных необходима для исполнения договора,
        </p>
        <p>
          стороной которого либо выгодоприобретателем или поручителем по
          которому
        </p>
        <p>
          является субъект персональных данных, а также для заключения договора
          по
        </p>
        <p>
          инициативе субъекта персональных данных или договора, по которому
          субъект
        </p>
        <p>
          персональных данных будет являться выгодоприобретателем или
          поручителем.
        </p>
        <p>
          9.5. Обработка персональных данных необходима для осуществления прав и
        </p>
        <p>законных интересов оператора или третьих лиц либо для достижения</p>
        <p>
          общественно значимых целей при условии, что при этом не нарушаются
          права и
        </p>
        <p>свободы субъекта персональных данных.</p>
        <p>
          9.6. Осуществляется обработка персональных данных, доступ
          неограниченного
        </p>
        <p>
          круга лиц к которым предоставлен субъектом персональных данных либо по
          его
        </p>
        <p>
          просьбе (далее&nbsp;&ndash;&nbsp;общедоступные персональные данные).
        </p>
        <p>9.7. Осуществляется обработка персональных данных, подлежащих</p>
        <p>
          опубликованию или обязательному раскрытию в соответствии с федеральным
        </p>
        <p>законом.</p>
        <p>10. Порядок сбора, хранения, передачи и других видов обработки</p>
        <p>персональных данных</p>
        <p>
          Безопасность персональных данных, которые обрабатываются Оператором,
        </p>
        <p>
          обеспечивается путем реализации правовых, организационных и
          технических
        </p>
        <p>
          мер, необходимых для выполнения в полном объеме требований
          действующего
        </p>
        <p>законодательства в области защиты персональных данных.</p>
        <p>
          10.1. Оператор обеспечивает сохранность персональных данных и
          принимает все
        </p>
        <p>возможные меры, исключающие доступ к персональным данным</p>
        <p>неуполномоченных лиц.</p>
        <p>
          10.2. Персональные данные Пользователя никогда, ни при каких условиях
          не
        </p>
        <p>будут переданы третьим лицам, за исключением случаев, связанных с</p>
        <p>
          исполнением действующего законодательства либо в случае, если
          субъектом
        </p>
        <p>
          персональных данных дано согласие Оператору на передачу данных
          третьему
        </p>
        <p>
          лицу для исполнения обязательств по гражданско-правовому договору.
        </p>
        <p>
          10.3. В случае выявления неточностей в персональных данных,
          Пользователь
        </p>
        <p>
          может актуализировать их самостоятельно, путем направления Оператору
        </p>
        <p>
          уведомление на адрес электронной почты
          Оператора&nbsp;stavropol@kiber-one.com&nbsp;с
        </p>
        <p>пометкой &laquo;Актуализация персональных данных&raquo;.</p>
        <p>
          10.4. Срок обработки персональных данных определяется достижением
          целей,
        </p>
        <p>для которых были собраны персональные данные, если иной срок не</p>
        <p>предусмотрен договором или действующим законодательством.</p>
        <p>
          Пользователь может в любой момент отозвать свое согласие на обработку
        </p>
        <div>
          <div tabindex="0"><br /></div>
        </div>
        <div>
          <div><br /></div>
        </div>
        <p>персональных данных, направив Оператору уведомление посредством</p>
        <p>
          электронной почты на электронный адрес
          Оператора&nbsp;stavropol@kiber-one.com&nbsp;с
        </p>
        <p>
          пометкой &laquo;Отзыв согласия на обработку персональных
          данных&raquo;.
        </p>
        <p>
          10.5. Вся информация, которая собирается сторонними сервисами, в том
          числе
        </p>
        <p>
          платежными системами, средствами связи и другими поставщиками услуг,
        </p>
        <p>
          хранится и обрабатывается указанными лицами (Операторами) в
          соответствии с
        </p>
        <p>
          их Пользовательским соглашением и Политикой конфиденциальности.
          Субъект
        </p>
        <p>
          персональных данных и/или Пользователь обязан самостоятельно
          своевременно
        </p>
        <p>
          ознакомиться с указанными документами. Оператор не несет
          ответственность за
        </p>
        <p>
          действия третьих лиц, в том числе указанных в настоящем пункте
          поставщиков
        </p>
        <p>услуг.</p>
        <p>
          10.6. Установленные субъектом персональных данных запреты на передачу
        </p>
        <p>
          (кроме предоставления&nbsp;доступа), а также на обработку или условия
          обработки
        </p>
        <p>(кроме получения доступа) персональных данных, разрешенных для</p>
        <p>
          распространения, не действуют в случаях обработки персональных данных
          в
        </p>
        <p>
          государственных, общественных и иных публичных интересах, определенных
        </p>
        <p>законодательством РФ.</p>
        <p>10.7. Оператор при обработке персональных данных обеспечивает</p>
        <p>конфиденциальность персональных данных.</p>
        <p>10.8. Оператор осуществляет хранение персональных данных в форме,</p>
        <p>
          позволяющей определить субъекта персональных данных, не
          дольше,&nbsp;чем этого
        </p>
        <p>
          требуют цели обработки персональных данных, если срок хранения
          персональных
        </p>
        <p>
          данных не установлен федеральным законом, договором, стороной
          которого,
        </p>
        <p>выгодоприобретателем или поручителем по которому является субъект</p>
        <p>персональных данных.</p>
        <p>
          10.9. Условием прекращения обработки персональных данных может
          являться
        </p>
        <p>
          достижение целей обработки персональных данных, истечение срока
          действия
        </p>
        <p>
          согласия субъекта персональных данных или отзыв согласия субъектом
        </p>
        <p>персональных данных, а также выявление неправомерной обработки</p>
        <p>персональных данных.</p>
        <p>11. Перечень действий, производимых Оператором с</p>
        <p>полученными персональными данными</p>
        <p>
          11.1. Оператор осуществляет сбор, запись, систематизацию, накопление,
        </p>
        <p>
          хранение, уточнение (обновление, изменение), извлечение,
          использование,
        </p>
        <p>
          передачу (распространение, предоставление, доступ), обезличивание,
        </p>
        <p>блокирование, удаление и уничтожение персональных данных.</p>
        <p>
          11.2. Оператор осуществляет автоматизированную обработку персональных
        </p>
        <p>данных с получением и/или передачей полученной информации по</p>
        <p>информационно-телекоммуникационным сетям или без таковой.</p>
        <p>12. Трансграничная передача персональных данных</p>
        <p>
          12.1. Оператор до начала осуществления трансграничной передачи
          персональных
        </p>
        <p>
          данных обязан убедиться в том, что иностранным государством, на
          территорию
        </p>
        <p>
          которого предполагается осуществлять передачу персональных данных,
        </p>
        <p>
          обеспечивается надежная защита прав субъектов персональных данных.
        </p>
        <p>
          12.2. Трансграничная передача персональных данных на территории
          иностранных
        </p>
        <p>
          государств, не отвечающих вышеуказанным требованиям, может
          осуществляться
        </p>
        <p>
          только в случае наличия согласия в письменной форме субъекта
          персональных
        </p>
        <div>
          <div tabindex="0"><br /></div>
        </div>
        <div>
          <div><br /></div>
        </div>
        <p>
          данных на трансграничную передачу его персональных данных и/или
          исполнения
        </p>
        <p>договора, стороной которого является субъект персональных данных.</p>
        <p>13. Конфиденциальность персональных данных</p>
        <p>
          Оператор и иные лица, получившие доступ к персональным данным, обязаны
          не
        </p>
        <p>
          раскрывать третьим лицам и не распространять персональные данные без
        </p>
        <p>согласия субъекта персональных данных, если иное не предусмотрено</p>
        <p>федеральным законом.</p>
        <p>14. Заключительные положения</p>
        <p>
          14.1. Пользователь может получить любые разъяснения по интересующим
        </p>
        <p>
          вопросам, касающимся обработки его персональных данных, обратившись к
        </p>
        <p>
          Оператору с помощью электронной почты&nbsp;stavropol@kiber-one.com.
        </p>
        <p>
          14.2. В данном документе будут отражены любые изменения политики
          обработки
        </p>
        <p>
          персональных данных Оператором. Политика действует бессрочно до замены
          ее
        </p>
        <p>новой версией.</p>
        <p>
          14.3. Актуальная версия Политики в свободном доступе расположена в
          сети
        </p>
        <p>Интернет по адресу&nbsp;https://kiber-stav.ru/privacy.</p>
        <div tabindex="0">
          <div>
            <div>
              <div tabindex="0"><br /></div>
            </div>
          </div>
        </div>
        <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p>
        <p>
          &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
          &nbsp;
        </p>
      </span>
    </div>
    <the-footer />
  </div>
</template>

<script>
import fModal from '~/components/f-modal.vue'
import Block1 from '~/components/block1.vue'
import Block2 from '~/components/block2.vue'
import Block3 from '~/components/block3.vue'
import Block4 from '~/components/block4.vue'
import Block5 from '~/components/block5.vue'
import MainSlides from '~/components/mainSlides.vue'
import TheHeader from '~/components/theHeader.vue'
import TheFooter from '~/components/theFooter.vue'
export default {
  name: 'IndexPage',
  components: {
    TheHeader,
    MainSlides,
    Block1,
    Block2,
    Block3,
    Block4,
    Block5,
    fModal,
    TheFooter
  },
  data () {
    return {
      succes: false,
      errors: [],
      form: {
        name: '',
        phone: '',
        vozrast: 6
      }
    }
  },
  methods: {
    YMEventOpenModal () {
      this.$yandexMetrika.reachGoal('open-modal-header')
    },
    YMEventSendTgModal () {
      this.$yandexMetrika.reachGoal('modal-form-tg')
    },
    scroll1 () {
      setTimeout(() => {
        let scrollDiv = document.getElementById('block2').offsetTop - 90
        window.scrollTo({ top: scrollDiv, behavior: 'smooth' })
      }, 300)
    },
    openModal () {
      this.$refs.modalForm.active = true
      this.YMEventOpenModal()
    },
    openmodal2 () {
      this.$refs.modalForm.active = true
      this.sendYandexMetrikaEvent()
    },
    plus () {
      if (this.form.vozrast < 14) {
        this.form.vozrast++
      }
    },
    minus () {
      if (this.form.vozrast > 6) {
        this.form.vozrast--
      }
    },
    async getTeelegrammToMain () {
      const fullMessege =
        'Заявка с формы модальное' +
        '\n' +
        'Телефон: ' +
        this.form.phone +
        '\n' +
        'Имя: ' +
        this.form.name +
        '\n' +
        'Возраст: ' +
        this.form.vozrast
      await this.$axios
        .post(
          'https://api.telegram.org/bot5959126365:AAFPC0KVUQeRFxclMIFeec2DtEhiEgSRiDw/sendMessage?chat_id=-1001842904151',
          {
            text: fullMessege
          }
        )
        .then(response => {
          this.form.phone = ''
          this.form.name = ''
          this.succes = true
          setTimeout(
            () => (
              (this.$refs.modalForm.active = false), (this.succes = false)
            ),
            1000
          )
          this.YMEventSendTgModal()
        })
        .catch(e => {
          this.errors.push(e)
        })
    }
  }
}
</script>
